; domain
(define (domain logistics)
  (:requirements :typing)
  (:types truck package location - object)
  (:predicates
    (at ?x - object ?l - location)
    (in ?p - package ?t - truck)
    (road ?l1 - location ?l2 - location))
  (:action drive
    :parameters (?t - truck ?from - location ?to - location)
    :precondition (and (at ?t ?from) (road ?from ?to))
    :effect (and (not (at ?t ?from)) (at ?t ?to)))
  (:action load
    :parameters (?p - package ?t - truck ?l - location)
    :precondition (and (at ?p ?l) (at ?t ?l))
    :effect (and (not (at ?p ?l)) (in ?p ?t)))
  (:action unload
    :parameters (?p - package ?t - truck ?l - location)
    :precondition (and (in ?p ?t) (at ?t ?l))
    :effect (and (not (in ?p ?t)) (at ?p ?l))))

; problem
(define (problem logistics-1)
  (:domain logistics)
  (:objects t1 - truck p1 - package a b c - location)
  (:init (at t1 a) (at p1 b) (road a b) (road b a) (road b c) (road c b))
  (:goal (at p1 c)))

; plan
1. (drive t1 a b)
   deleted: (at t1 a)
   added: (at t1 b)
   goals met: 0 of 1
2. (load p1 t1 b)
   deleted: (at p1 b)
   added: (in p1 t1)
   goals met: 0 of 1
3. (drive t1 b c)
   deleted: (at t1 b)
   added: (at t1 c)
   goals met: 0 of 1
4. (unload p1 t1 c)
   deleted: (in p1 t1)
   added: (at p1 c)
   goals met: 1 of 1
